!!!! ##important facts about VLANs !!!!

when you do 
    interface range fa0/1 - 2

            switchport mode access

            switchport access vlan 10
    all end point devices connected to that port will fall into that vlan

Access port carries traffic for one vlan only !!! 
Trunk port carries traffic for mutiple vlans used to connect switches and router on a stick.


VLANs are seperate esentially sperate networks in one switch and requires a router or layer 3 switch to function.
END point devices are not awere they are even part of a vlan.
Frame within vlans are not tagged, but when it leaves a trunk port it gets tagged with the vlan it came from.
When a router recieves an tagged port it gets untagged and gets tagged with the vlan the frame is destined to.
When the trunk port recives the tagged frame it strips it and sends it to the vlan it belongs to.
TRUNK PORTS belong to all vlans
SUBINTERFACES on a router have the same MAC, this is fine because Each Vlan has their own MAC ADDRESS TABLES 

##switch config for router on a stick
##create vlans
switch> enable
switch# conf t
switch(config)# vlan 10 (creates vlan10)
switch(config-vlan)# name SIGMA (naming pruposes only)
exit

switch(config) vlan 20
switch(config-vlan)# name SIGMA2
exit

##asign ports to vlan

switch(config)# interface range fa0/1 - 2
switch(config-if)# switchport mode access
                    switchport acess vlan 10 
changes port fa0/1-2 as access port and assign them as vlan 10

switch(config)# interface range fa0/3 - 4
switch(config-if)# switchport mode access
                    switchport acess vlan 20 
##changes port fa0/3-4 as access port and assign them as vlan 20

##confgire the port connected to the router as a trunk port
switch(config)# int f0/24
switch(config-if) switchport mode trunk
                    switchport encapsulation dot1q (if suporrted)
                    switchport trunk allowed vlan 10,20
                    exit

#CHECK VLAN
switch# show vlan b

Check trunk
switch# show interfaces trunk


                    

Router on A stick COnfig
###Create Virtaul subinteraces on one physical interface 
Each subinterface has its own NETWORK ID acting as a gateway for devices in different VLAN
You tagged each sub-int with encapsulation dot1Q 10 20 or 30, now the router knows any time it recives a frame with a vlan tag send it to that sub-int

routerrouter(config)# int g/0/0 not shut

router(config)# interface g0/0/0.10 (.10 can really be .69 but should match vlan ID)
router(config-subif)# encapsulation dot1Q 10 (tells the router this sub interface handles vlan 10 traffic, any frame leaving this sub-int gets tagged with 10.
router(config-subif)# ip addr 192.168.10.1 255.255.255.0

router(config)# int g0/0/0.20
router(config-subif)# encapsulation dot1Q 20
router(config-subif)# ip addr 192.168.20.1 255.255.255.0

DHCP CONFIG
DHCP works in router config utizliing vlan tags
PC broadcast DHCP to switch, switch sends its out the trunk port and tags it with the VLAN ID IT came from, Router recieves it sees vlan 10 ID lets .10 sub-int handle it. IT checks its network of the sub-int and mathces it to the correct dhcp pool.

EXCLUDE GATEWAY IPs
router(config)# ip dhcp excluded-address 192.168.10.1
router(config)# ip dhcp excluded-address 192.168.20.1

router(config)# ip dhcp pool VLAN10 (vlan10 is just a name)
router(dhcp-config)# network 192.168.10.0 255.255.255.0
                     default-router 192.168.10.1
                     dns-server 8.8.8.8    
                     exit

router(config)# ip dhcp pool VLAN20  (vlan20 is just a name)
router(dhcp-config)# network 192.168.20.0 255.255.255.0
                     default-router 192.168.20.1
                     dns-server 8.8.8.8    
                     exit

Router Drops all broadcast packets, and DHCP utizlies broadcaset for discover, unless told with the helper command the router will drop all broadcast packets, this tells it forward it to the dhcp server
ip helper-address <IP>













Turn the port connected the swtich to the router into a trunk port 
    configure terminal
interface GigabitEthernet0/1
 switchport mode trunk
 switchport trunk encapsulation dot1q   ← (only needed on older switches)
 switchport trunk allowed vlan 10,20    ← (optional: restrict to specific VLANs)
exit




Switch-to-Switch Connection:

    Connected switches via g0/1 and g0/2  on each

    Enabled trunking:

        interface g0/1 or g0/2

        switchport mode trunk

Result:

    Devices in VLAN 10 across both switches can communicate and receive IPs from the DHCP server in VLAN 20

    VLAN 20 is isolated except for DHCP services

    Inter-VLAN routing is handled by the router’s subinterfaces


add ip to swtich to allow ssh
interface vlan 10
ip address 192.168.10.10 255.255.255.0
exit first
ip default-gateway 192.168.10.1

the deafult -gateway is to allow other vlan to ssh aswell.
